Revit 2026 API

# Stone Class

---

A static class that provides access to the property names that appear in the Stone visual asset schema.

SystemObject Autodesk.Revit.DB.VisualStone

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class Stone
```
```vb
Public NotInheritable Class Stone
```
```cpp
public ref class Stone abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Stone = class end
```

The Stone type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CommonTintColor | The property labeled "Tint Color" from the "Stone" schema. |
|  | CommonTintToggle | The property labeled "Tint" from the "Stone" schema. |
|  | StoneApplication | The property labeled "Finish" from the "Stone" schema. |
|  | StoneBump | The property labeled "Type" from the "Stone" schema. |
|  | StoneBumpAmount | The property labeled "Amount" from the "Stone" schema. |
|  | StoneBumpMap | The property labeled "Image" from the "Stone" schema. |
|  | StoneColor | The property labeled "Image" from the "Stone" schema. |
|  | StonePattern | The property labeled "Relief Pattern" from the "Stone" schema. |
|  | StonePatternAmount | The property labeled "Amount" from the "Stone" schema. |
|  | StonePatternMap | The property labeled "Image" from the "Stone" schema. |

#### Reference

Autodesk.Revit.DB.Visual Namespace